% 4 вар

% очистка экрана и рабочего пространства

clc;
clear;
close;

% описываем нашу схему

R0 = 4;
In = 100;
Un = In * R0;

Uv = Un; % 2 з-н Кирхгофа
Iv = 97.2;
Rv = Uv / Iv;

w = 3000; % число витков

k = 1000; % множитель для варианта 4

F = [0 1.0 1.5 2.0 2.5 3.0 3.5 4.0 5.0]' .*k ./ (w .* Rv);
F1 = ([0 1.0 1.5 2.0 2.5 3.0 3.5 4.0 5.0] + 0.001)' .*k ./ (w .* Rv);

Fnenorm = F.*(w .* Rv);
Fi = [0 0.66 0.93 1.18 1.38 1.5 1.6 1.67 1.79];

% уравнение невязок в матричном виде для n = 3

G1 = [];
G1(:,1) = Fi'.^0;
G1(:,2) = Fi'.^1;
G1(:,3) = Fi'.^2;
G1(:,4) = Fi'.^3;

C1 = inv(G1'*G1)*(G1'*F);
p1 = [C1(4) C1(3) C1(2) C1(1)];
P1 = polyval(p1, Fi);
% J = (F-G1*C1)'*(F-G1*C1); % уравнение, которое не использовалось

% уравнение невязок в матричном виде для n = 5

G2 = [];
G2(:,1) = Fi'.^0;
G2(:,2) = Fi'.^1;
G2(:,3) = Fi'.^2;
G2(:,4) = Fi'.^3;
G2(:,5) = Fi'.^4;
G2(:,6) = Fi'.^5;

C2 = inv(G2'*G2)*(G2'*F);
p2 = [C2(6) C2(5) C2(4) C2(3) C2(2) C2(1)];
P2 = polyval(p2, Fi);

% строим правый график

subplot(1, 2, 1); % одно окно по вертикали 2 по горизонтали, работаем с 1-ым окном
plot(Fi, F,'*', Fi, P1, 'r--', Fi ,P2);
legend('F(т)', 'p(т) n=3', 'p(т) n=5');
title('');
xlabel('т'); ylabel('F,p');
grid on;

Finn = Fi.*0.01;

% уравнение невязок в матричном виде для n = 3

G3 = [];
G3(:,1) = Finn'.^0;
G3(:,2) = Finn'.^1;
G3(:,3) = Finn'.^2;
G3(:,4) = Finn'.^3;

C3 = inv(G3'*G3)*(G3'*Fnenorm);
p3 = [C3(4) C3(3) C3(2) C3(1)];
P3 = polyval(p3,Finn);

% уравнение невязок в матричном виде для n = 5

G4 = [];
G4(:,1) = Finn'.^0;
G4(:,2) = Finn'.^1;
G4(:,3) = Finn'.^2;
G4(:,4) = Finn'.^3;
G4(:,5) = Finn'.^4;
G4(:,6) = Finn'.^5;

C4 = inv(G4'*G4)*(G4'*Fnenorm);
p4 = [C4(6) C4(5) C4(4) C4(3) C4(2) C4(1)];
P4 = polyval(p4,Finn);

% строим левый график

subplot(1, 2, 2); % работаем с 2-ым окном
plot(Finn, Fnenorm, '*', Finn, P3, 'r--', Finn, P4);
legend('F(т)', 'p(т) n=3', 'p(т) n=5');
title('');
xlabel('т'); ylabel('F,p');
grid on;
Сау, брат!