% 4 вар

% очистка экрана и рабочего пространства

clc;
clear;
close;

% описываем нашу схему

R0 = 4;
In = 100;
Un = In * R0;

Uv = Un; % 2 з-н Кирхгофа
Iv = 97.2;
Rv = Uv / Iv;

w = 3000; % число витков

k = 1000; % множитель для варианта 4

F_n = 5000; % ??????????
F = [0 1.0 1.5 2.0 2.5 3.0 3.5 4.0 5.0]' .* k; % ненормированная МДС
F_norm = F ./ F_n; % нормированная МДС

Fi_n = 0.01;
Fi_norm = ([0 0.66 0.93 1.18 1.38 1.5 1.6 1.67 1.79] + 0.001)'; % нормированны магнитный поток
Fi = Fi_norm.*Fi_n; % ненормированный магнитный поток

% ---------------------------------------------------------

% нормированные величины

% уравнение невязок в матричном виде для n = 3

G1 = [];
G1(:,1) = Fi_norm'.^0;
G1(:,2) = Fi_norm'.^1;
G1(:,3) = Fi_norm'.^2;
G1(:,4) = Fi_norm'.^3;

C1 = inv(G1'*G1)*(G1'*F_norm);
p3_norm = [C1(4) C1(3) C1(2) C1(1)];
P3_norm = polyval(p3_norm, Fi_norm); % оценивает полиномиальный p3_norm в каждой точке в Fi_norm

% функционал точности для n = 3

Jnorm3 = (F_norm-G1*C1)'*(F_norm-G1*C1)

% уравнение невязок в матричном виде для n = 5

G2 = [];
G2(:,1) = Fi_norm'.^0;
G2(:,2) = Fi_norm'.^1;
G2(:,3) = Fi_norm'.^2;
G2(:,4) = Fi_norm'.^3;
G2(:,5) = Fi_norm'.^4;
G2(:,6) = Fi_norm'.^5;

C2 = inv(G2'*G2)*(G2'*F_norm);
p5_norm = [C2(6) C2(5) C2(4) C2(3) C2(2) C2(1)];
P5_norm = polyval(p5_norm, Fi_norm);

% функционал точности для n = 5

Jnorm5= (F_norm-G2*C2)'*(F_norm-G2*C2)

% строим правый график

subplot(1, 2, 1); % одно окно по вертикали 2 по горизонтали, работаем с 1-ым окном
plot(Fi_norm, F_norm,'b*', Fi_norm, P3_norm, 'r--', Fi_norm, P5_norm, 'g-.');
legend('F_n_o_r_m(Fi_n_o_r_m)', 'p(Fi_n_o_r_m) n=3', 'p(Fi_n_o_r_m) n=5');
title('нормированный случай');
xlabel('Fi_n_o_r_m');
ylabel('F_n_o_r_m');
grid on;

% ---------------------------------------------------------

% ненормированные величины

% уравнение невязок в матричном виде для n = 3

G3 = [];
G3(:,1) = Fi'.^0;
G3(:,2) = Fi'.^1;
G3(:,3) = Fi'.^2;
G3(:,4) = Fi'.^3;

C3 = inv(G3'*G3)*(G3'*F);
p3 = [C3(4) C3(3) C3(2) C3(1)];
P3 = polyval(p3, Fi);

% функционал точности для n = 3

Jnenorm3 = (F-G3*C3)'*(F-G3*C3)

% уравнение невязок в матричном виде для n = 5

G4 = [];
G4(:,1) = Fi' .^ 0;
G4(:,2) = Fi' .^ 1;
G4(:,3) = Fi' .^ 2;
G4(:,4) = Fi' .^ 3;
G4(:,5) = Fi' .^ 4;
G4(:,6) = Fi' .^ 5;

C4 = inv(G4'*G4)*(G4'*F);
p5 = [C4(6) C4(5) C4(4) C4(3) C4(2) C4(1)];
P5 = polyval(p5,Fi);

% функционал точности для n = 5

Jnenorm5 = (F-G4*C4)'*(F-G4*C4)

% строим левый график

subplot(1, 2, 2); % работаем с 2-ым окном
plot(Fi, F, 'b*', Fi, P3, 'r--', Fi, P5, 'g-.');
legend('F(Fi)', 'p(Fi) n=3', 'p(Fi) n=5');
title('ненормированный случай');
xlabel('Fi');
ylabel('F');
grid on;